import sqlite3

# Dictionnaire de conversion des caractères accentués
accent_dict = {
    'à': 'a', 'â': 'a', 'ä': 'a', 'á': 'a', 'ã': 'a', 'å': 'a',
    'ç': 'c',
    'é': 'e', 'è': 'e', 'ê': 'e', 'ë': 'e', 'ē': 'e', 'ė': 'e', 'ę': 'e', 'ẽ': 'e', 'ě': 'e',
    'î': 'i', 'ï': 'i', 'í': 'i', 'ì': 'i', 'ĩ': 'i', 'ī': 'i', 'ĭ': 'i', 'į': 'i', 'ı': 'i',
    'ô': 'o', 'ö': 'o', 'ò': 'o', 'ó': 'o', 'õ': 'o', 'ø': 'o', 'ō': 'o', 'ŏ': 'o', 'ő': 'o',
    'ù': 'u', 'û': 'u', 'ü': 'u', 'ú': 'u', 'ũ': 'u', 'ū': 'u', 'ŭ': 'u', 'ů': 'u', 'ű': 'u', 'ų': 'u',
    'ý': 'y', 'ÿ': 'y', 'ŷ': 'y',
    'À': 'A', 'Â': 'A', 'Ä': 'A', 'Á': 'A', 'Ã': 'A', 'Å': 'A',
    'Ç': 'C',
    'É': 'E', 'È': 'E', 'Ê': 'E', 'Ë': 'E', 'Ē': 'E', 'Ė': 'E', 'Ę': 'E', 'Ẽ': 'E', 'Ě': 'E',
    'Î': 'I', 'Ï': 'I', 'Í': 'I', 'Ì': 'I', 'Ĩ': 'I', 'Ī': 'I', 'Ĭ': 'I', 'Į': 'I', 'I': 'I',
    'Ô': 'O', 'Ö': 'O', 'Ò': 'O', 'Ó': 'O', 'Õ': 'O', 'Ø': 'O', 'Ō': 'O', 'Ŏ': 'O', 'Ő': 'O',
    'Ù': 'U', 'Û': 'U', 'Ü': 'U', 'Ú': 'U', 'Ũ': 'U', 'Ū': 'U', 'Ŭ': 'U', 'Ů': 'U', 'Ű': 'U', 'Ų': 'U',
    'Ý': 'Y', 'Ÿ': 'Y', 'Ŷ': 'Y'
}

def remove_accents(dic , text):
    """Remplace les caractères accentués dans `text` en utilisant `accent_dict`.
        À comprendre !!!
    """
    return ''.join(accent_dict.get(char, char) for char in text)

